app/controllers/reminders_controller.rb

  def index
    authorize_action
    reminders = Reminder.all
    reminders_by_date = reminders.group_by(&:date)
---
SELECT "reminders".* FROM "reminders"

  def create
    authorize_action
    reminder = Reminder.create(reminder_params)
    if reminder.save
---
INSERT INTO "reminders" ("datetime", "message", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["datetime", "2021-07-24 10:19:00"], ["message", "first call"], ["color", "#53df20"], ["created_at", "2021-07-23 14:19:38.116047"], ["updated_at", "2021-07-23 14:19:38.116047"]]
INSERT INTO "reminders" ("datetime", "message", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["datetime", "2021-07-21 17:47:00"], ["message", "21 phone call"], ["color", "#19c824"], ["created_at", "2021-07-21 21:45:43.163978"], ["updated_at", "2021-07-21 21:45:43.163978"]]

  def update
    authorize_action(reminder)
    if reminder.update(reminder_params)
---
UPDATE "reminders" SET "color" = $1, "updated_at" = $2 WHERE "reminders"."id" = $3  [["color", "#c41742"], ["updated_at", "2021-07-23 14:19:50.799017"], ["id", 1]]

  def destroy
    authorize_action(reminder)
    reminder.destroy!
---
DELETE FROM "reminders" WHERE "reminders"."id" = $1  [["id", 123]]

  def reminder
    @reminder ||= Reminder.find(params[:id])
---
SELECT "reminders".* FROM "reminders" WHERE "reminders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]